#include<iostream>
#include<iomanip>
#include<ctime>
#include<fstream>
#include<stdio.h>
#include <string>
#include <stdlib.h>
#include<cstdlib>
#include<cstring>
using namespace std;
#include "student.h"
#include "slist.h"
#include "iofunc.h"
#include "statistics.h"

string getTime() {
	time_t timep;
	struct tm info;
	//time(&timep); //获取time_t类型的当前时间    
	char tmp[64];
	time(&timep);
	localtime_s(&info, &timep);
	strftime(tmp, sizeof(tmp), "%Y年%m月%d日", &info);//对日期和时间进行格式化    
	return tmp;
}
int main()
{
	create();
	havedata=getfromdata();
	bool inputerror = 0;
	string now_time;
	int cmd;
	now_time = getTime();
	cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
	cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
	cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎来到学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
	cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
	if (!havedata) {
		cout << " \\/\\/\\/\\/\\/当前无学生数据，请输入数据/\\/\\/\\/\\/\\/\\\n";
	}
	cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
	cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
	cout << " /                    1.学生信息录入                     /\n";
	cout << " \\                    2.学生信息总览                     \\\n";
	cout << " /                    3.学生信息修改                     /\n";
	cout << " \\                    4.学生信息删除                     \\\n";
	cout << " /                    5.学生成绩查询                     /\n";
	cout << " \\                    6.学生成绩排序                     \\\n";
	cout << " /                    7.学生成绩统计                     /\n";
	cout << " \\                    8.打印总成绩单                     \\\n";
	cout << " /                    9.保存当前修改                     /\n";
	cout << " \\                   10.退回上次修改                     \\\n";
	cout << " /                   11.设置与帮助                       /\n";
	cout << " \\                    0.安全退出系统                     \\\n";
	cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";


	cout << "\t\t请输入您所需要的服务序号：";
	while (1) {
		cin >> cmd;
		if (cin.fail()) {
			cin.clear();
			cin.ignore(1024, '\n');
			num = 0;
		}
		//学生信息录入界面
		switch(cmd) {
		case 1:
			system("cls");
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			add();
			break;
		case 2:
			if (!havedata) {
				cout << "当前无数据，请录入学生数据。" << endl;
				inputerror = 1;
			}
			else {
				system("cls");
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				list();
				system("pause");//可以加入打印模块
			}
			
			break;
		case 3:
			system("cls");
			
			while (1) {
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				list();
				cout << "请选择您要修改信息的学生序号(输入0取消)：";
				int id;
				cin >> id;
				if (cin.fail()) {
					cout << "输入错误，请重新输入。" << endl;
					cin.clear();
					cin.ignore(1024, '\n');
					continue;
				}
				else if (id == 0) {
					break;
				}
				else {
					while (1) {
						cout << "\t\t1.修改学生学号：\n";
						cout << "\t\t2.修改学生姓名：\n";
						cout << "\t\t3.修改学生性别：\n";
						cout << "\t\t4.修改学生高数成绩：\n";
						cout << "\t\t5.修改学生英语成绩：\n";
						cout << "\t\t6.修改学生计算机成绩：\n";
						cout << "请选择您要修改的内容：";
						int item;
						cin >> item;
						if (cin.fail()) {
							cout << "输入错误，请重新输入。" << endl;
							cin.clear();
							cin.ignore(1024, '\n');
							continue;
						}
						else {
								if (change(id, item)) {
									break;
								}
								else {
									cout << "输入错误，请重新输入。" << endl;
									continue;
								}
						}
					}
					system("cls");
				}
			}
			
			break;
		case 4:
			system("cls");
			while (1) {
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				list();
				cout << "请选择您要删除信息的学生序号(输入0取消)：";
				int id;
				cin >> id;
				if (cin.fail()) {
					cout << "输入错误，请重新输入。" << endl;
					cin.clear();
					cin.ignore(1024, '\n');
					continue;
				}
				else if (id == 0) {
					break;
				}
				else {
					student* p = head;
					int j=0;
					bool find = 0;
					while (p->next != 0) {
						p = p->next;
						++j;
						if (j == id) {
							find = 1;
							break;
						}
					}
					if (!find) {
						cout << "找不到序号为" << id << "的学生，请重新输入。" << endl;
						continue;
					}
					cout << "确认删除" << p->name << "的全部信息嘛？（Y/N)";//姓名为对应的学生姓名
					char c;
					cin >> c;
					if (c == 'y' || c == 'Y') {
						remove(id);
						system("cls");
					}
					else{
						continue;
					}
				}
				
			}
			break;
		case 5:
			//学生信息查询界面
			system("cls");
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << "\t\t1.通过学生学号查询\n";
			cout << "\t\t2.通过学生姓名查询\n";
			cout << "\t\t0.返回上一界面\n";
			cout << "请选择查询方式：";
			while (1) {
				int id;
				cin >> id;
				if (cin.fail()) {
					cout << "输入错误，请重新输入。" << endl;
					cin.clear();
					cin.ignore(1024, '\n');
					continue;
				}
				else if (id == 0) {
					break;
				}
				else if(id==1){
					cout << "请输入您所查询学生的学号：";
					char xh[12];
					cin >> xh;
					if (!search(id, xh)) {
						cout << "未找到该学生,请重新输入。" << endl;
						continue;
					}
					else {
						cout << "请选择查询方式：";
					}
				}
				else if (id == 2) {
					cout << "请输入您所查询学生的姓名：";
					char name[22];
					cin >> name;
					if (!search(id, name)) {
						cout << "未找到该学生,请重新输入。" << endl;
						continue;
					}
					else {
						cout << "请选择查询方式：";
					}
				}	
				else {
					cout << "输入错误，请重新输入。" << endl;
					continue;
				}
			}
			break;
		case 6:
			//学生成绩排序界面
			system("cls");
			
			while (1) {
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
				cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
				cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
				cout << "您可以查看：\n";
				cout << "\t\t1.高数成绩排序情况\n";
				cout << "\t\t2.英语成绩排序情况\n";
				cout << "\t\t3.计算机成绩排序情况\n";
				cout << "\t\t4.平均成绩排序情况\n";
				cout << "\t\t0.返回上一界面\n";
				cout << "请输入您选择的服务：";
				int id;
				cin >> id;
				if (cin.fail()) {
					cout << "输入错误，请重新输入。" << endl;
					cin.clear();
					cin.ignore(1024, '\n');
					continue;
				}
				else if (id == 0) {
					break;
				}
				else {
					while (1) {
						cout << "您可以选择：";
						cout << "1.升序排序\t2.降序排序";
						cout << endl;
						cout << "请输入您选择的服务：";
						int up;
						cin >> up;
						if (cin.fail()) {
							cout << "输入错误，请重新输入。" << endl;
							cin.clear();
							cin.ignore(1024, '\n');
							continue;
						}
						else if (up!=1&&up!=2) {
							cout << "输入错误，请重新输入。" << endl;
							continue;
						}
						else {
							bool order = up == 1 ? 0 : 1;
							sortlist(id, order);
							system("cls");
							cout << "排序结果为:" << endl;
							list();
							system("pause");
							system("cls");
							break;
						}
					}
				}
			}
			break;
		case 7://学生成绩统计页面
			system("cls");
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << "统计结果为：\n";
			statistics();
			system("pause");
			break;
		case 8:
			system("cls");
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎使用学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << "\t\t1.保存为TXT文件。\n";
			cout << "\t\t2.保存为xls文件。\n";
			cout << "\t\t0.返回上一界面\n";
			cout << "请选择保存的文件类型：";
			int id;
			cin >> id;
			if (cin.fail()) {
				cout << "输入错误，请重新输入。" << endl;
				cin.clear();
				cin.ignore(1024, '\n');
				continue;
			}
			else if (id == 0) {
				break;
			}
			else if (id > 2) {
				cout << "输入错误，请重新输入。" << endl;
				continue;
			}
			else {
				saveas(id);
			}
			

			break;
		case 0:
			quit();
			break;
		case 9:
			save();
			cout << "已保存修改。" << endl;
			system("pause");
			break;
		case 10:
			while (tail->before!=0) {
				tail = tail->before;
				delete tail->next;
				tail->next = 0;
			}
			getfromdata();
			cout << "已返回上次修改。" << endl;
			system("pause");
			break;
		case 11:

			break;
		default:
			cout << "输入错误，请重新输入。" << endl;
			inputerror = 1;
		}
		if (inputerror) {
			inputerror = 0;
		}
		else {
			system("cls");
			now_time = getTime();
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /\\/\\/\\/\\/\\/\\/\\/欢迎来到学生成绩管理系统\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/今天是" << now_time << ",祝您使用愉快！" << "/\\/\\/\\/\\/\\/\\\n";
			if (!havedata) {
				cout << " \\/\\/\\/\\/\\/当前无学生数据，请输入数据/\\/\\/\\/\\/\\/\\\n";
			}
			cout << " /\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";
			cout << " /                    1.学生信息录入                     /\n";
			cout << " \\                    2.学生信息总览                     \\\n";
			cout << " /                    3.学生信息修改                     /\n";
			cout << " \\                    4.学生信息删除                     \\\n";
			cout << " /                    5.学生成绩查询                     /\n";
			cout << " \\                    6.学生成绩排序                     \\\n";
			cout << " /                    7.学生成绩统计                     /\n";
			cout << " \\                    8.打印总成绩单                     \\\n";
			cout << " /                    9.保存当前修改                     /\n";
			cout << " \\                   10.退回上次修改                     \\\n";
			cout << " /                   11.设置与帮助                       /\n";
			cout << " \\                    0.安全退出系统                     \\\n";
			cout << " \\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\/\\\n";


			cout << "\t\t请输入您所需要的服务序号：";
		}
	}
	return 0;
}